OpenFOAM_FluidMechanics/Plunging_Airfoil/system/functions/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the turbulence y+, outputting the data as a yPlus field.

\*---------------------------------------------------------------------------*/


yPlus
{
    libs            ("libfieldFunctionObjects.so");
    type            yPlus;
    writeControl    adjustableRunTime;
    writeInterval   0.05;
}


// ************************************************************************* //
